nb/app/controllers/presidents_controller.rb

  def index
    @presidents = President.all
---
SELECT "presidents".* FROM "presidents"

  def create
    @president = President.new(president_params)

    respond_to do |format|
      if @president.save
---
INSERT INTO "presidents" ("name", "comment", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"

    def set_president
      @president = President.find(params[:id])
---
SELECT "presidents".* FROM "presidents" WHERE "presidents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]